#coding=utf-8
#bishi names
L1=["陈刚","唐莉莉","陈勇勇","陶启","成蕾","王凯博","戴勇","项昊龙","董路梅","徐政","何昕","徐子龙","贺艳芳","薛天宇","黄鑫海","杨维永","黄羿","杨炜辰","嵇宇骋","于阳阳","江露","袁宏斌","琚江舟","袁明磊","孔骋","臧思聪","李飞","詹林涛","李杰","张德志","李俊瑶","张洁","李娜","张勤学","李培丰","张杨","李幸刚","张振宇","廖泽良","张众","林云霞","赵成龙","刘红英","赵大鹏","刘若泽","赵楠","麦丞程","仲晓伟","孟繁荣","朱大鹏","倪超","朱惠娟","牛中瀚","朱建勇","沈毅","朱坤"]
#bishi default
L2=["陈刚", "沈毅", "陈勇勇", "唐莉莉", "成蕾", "王凯博", "戴勇", "徐子龙", "何昕", "薛天宇", "贺艳芳", "杨维永", "黄鑫海", "于阳阳", "黄羿", "袁宏斌", "嵇宇骋", "袁明磊", "江露", "詹林涛", "琚江舟", "张德志", "孔骋", "张洁", "李杰", "张勤学", "李俊瑶", "张杨", "李培丰", "张振宇", "李幸刚", "张众", "廖泽良", "赵成龙", "林云霞", "赵大鹏", "刘红英", "赵楠", "刘若泽", "仲晓伟", "麦丞程", "朱惠娟", "孟繁荣", "朱坤", ]
#tiqian
L3=["董路梅", "江威明", "李飞", "李娜", "倪超", "牛中瀚", "邵长斌", "陶启", "王佺", "王蔚峻", "项昊龙", "徐苏平", "徐政", "薛明龙", "杨炜辰", "臧思聪", "赵全玉", "朱大鹏", "朱建勇"]
print len(L1)
print len(L2)
print len(L3)
print ",".join(set(L3)-(set(L1)-set(L2)))
